Documents/РасчетЗаработнойПлатыСотрудникам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>РасчетЗаработнойПлатыСотрудникам</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Месяца</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасчетЗП</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оклад</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсегоРабочихДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтработаноДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Премия</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоВычетаНДФЛ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДФЛ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КВыплате</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РасчетЗаработнойПлатыСотрудникам/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура РасчетЗПСотрудникПриИзменении(Элемент)
	ТекДанные = Элементы.РасчетЗП.ТекущиеДанные;
	ТекДанные.Должность = ПолучитьДолжность (ТекДанные.Сотрудник);
	ТекДанные.Оклад = ПолучитьОклад (ТекДанные.Должность);
	ТекДанные.Премия = ТекДанные.Оклад * 15/100;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДолжность (Наименование)
	Возврат Наименование.Должность;
КонецФункции

&НаКлиенте
Процедура РасчетЗПДолжностьПриИзменении(Элемент)
	ТекДанные = Элементы.РасчетЗП.ТекущиеДанные;
	ТекДанные.Оклад = ПолучитьОклад (ТекДанные.Должность);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОклад (Наименование)
	Возврат Наименование.Оклад;
КонецФункции

&НаКлиенте
Процедура РасчетЗПОтработаноДнейПриИзменении(Элемент)
	кк = Элементы.РасчетЗП.ТекущиеДанные;
	кк.ДоВычетаНДФЛ = кк.Оклад / кк.ВсегоРабочихДней * кк.ОтработаноДней + кк.Премия;
КонецПроцедуры 

&НаКлиенте
Процедура РасчетЗППремияПриИзменении(Элемент)
	кк = Элементы.РасчетЗП.ТекущиеДанные;
	кк.ДоВычетаНДФЛ = кк.Оклад / кк.ВсегоРабочихДней * кк.ОтработаноДней + кк.Премия;
КонецПроцедуры

&НаКлиенте
Процедура РасчетЗПНДФЛПриИзменении(Элемент)
	кк = Элементы.РасчетЗП.ТекущиеДанные;
	кк.КВыплате = кк.ДоВычетаНДФЛ - кк.ДоВычетаНДФЛ * кк.НДФЛ/100;
КонецПроцедуры
